<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.03 [en] (Win95; I) [Netscape]">
   <TITLE>    


Curso de Cria&ccedil;&atilde;o de Componentes em Delphi    


  





</TITLE>
</HEAD>
<BODY BACKGROUND="delphi2.gif">
&nbsp;
<TABLE>
<TR>
<TD><IMG SRC="delphi.gif" ALT="delphi.gif - 582,0 K" HEIGHT=116 WIDTH=126>&nbsp;</TD>

<TD>
<CENTER><FONT FACE="ARIAL"><FONT COLOR="#008000"><FONT SIZE=+4>Curso de
cria&ccedil;&atilde;o de componentes em Delphi</FONT></FONT></FONT></CENTER>
&nbsp;
<CENTER><B><FONT FACE="ARIAL"><FONT COLOR="#FF0000"><FONT SIZE=+2>Unidade
1. Introdu&ccedil;&atilde;o para o curso</FONT></FONT></FONT></B>&nbsp;</CENTER>
</TD>

<TD><IMG SRC="delphi.gif" ALT="delphi.gif - 582,0 K" HEIGHT=116 WIDTH=126>&nbsp;</TD>
</TR>
</TABLE>
&nbsp;
<TABLE>
<TR>
<TD WIDTH="300"><A HREF="ccind.htm">Voltar ao &iacute;ndice</A>&nbsp;</TD>

<TD><I><FONT FACE="Times New Roman"><FONT COLOR="#008040"><FONT SIZE=+2>Por
Luis Roche</FONT></FONT></FONT></I>&nbsp;<A HREF="mailto:revueltaroche@redestb.es"><IMG SRC="emailed.gif" ALT="emailed.gif - 15503,0 K" HSPACE=10 VSPACE=10 BORDER=0 HEIGHT=51 WIDTH=44 ALIGN=ABSCENTER></A><A HREF="mailto:revueltaroche@redestb.es">&nbsp;</A></TD>
</TR>
</TABLE>

<HR><A NAME="Objetivo"></A><IMG SRC="Bverde.gif" ALT="Bverde.gif - .325 K" HEIGHT=14 WIDTH=14>
<B><FONT SIZE=+2>Objetivo do curso.</FONT></B>

<P>Este curso busca oferecer uma aproxima&ccedil;&atilde;o ao desenvolvimento
de componentes de um ponto de vista eminentemente pr&aacute;tico. Em uma
por&ccedil;&atilde;o de livros de programa&ccedil;&atilde;o em Delphi est&aacute;
o t&oacute;pico do desenvolvimento de componentes, mas s&oacute; de um
modo r&aacute;pido e superficial. O modo certo &eacute; aquele dos manuais
do Delphi que s&atilde;o completamente dedicados a este t&oacute;pico,
mas, a meu modo de ver, sofre de falta de exemplos pr&aacute;ticos que
v&atilde;o passo pedag&oacute;gico a um modo gradual do desenvolvimento
de componentes. Tamb&eacute;m certos t&oacute;picos, (p.e o t&oacute;pico
de editores de propriedades) eles permanecem muito no ar.

<P>Este curso tentar&aacute; cobrir estas faltas. Este curso busca ser
principalmente pr&aacute;tico: a teoria da cria&ccedil;&atilde;o de componentes
deixar&aacute; vendo como voc&ecirc; precisa. Voc&ecirc; come&ccedil;ar&aacute;
a ver a teoria b&aacute;sica de cria&ccedil;&atilde;o de componente e imediatamente
ser&aacute; aplicado &agrave; cria&ccedil;&atilde;o de componentes completamente
funcionais.

<P>Ao longo do curso n&oacute;s aprenderemos a criar componentes de tipos
muito diversos. N&oacute;s come&ccedil;aremos com um visual e n&atilde;o-visuais
e n&oacute;s iremos progredindo na cria&ccedil;&atilde;o de componentes
gr&aacute;ficos, editores de propriedades, componentes de banco de dados...
Tamb&eacute;m ser&aacute; explicado como criar os arquivos de ajuda para
fazer com que nosso componente seja completamente integrado no ambiente
de desenvolvimento de Delphi.
<BR><A NAME="Previos"></A><IMG SRC="Bverde.gif" ALT="Bverde.gif - .325 K" HEIGHT=14 WIDTH=14><B><FONT SIZE=+2>
Conhecimento pr&eacute;vio.</FONT></B>

<P>Mas isto n&atilde;o &eacute; um curso de programa&ccedil;&atilde;o em
Delphi, nem um curso de programa&ccedil;&atilde;o n&atilde;o guiado a objetos.
&Eacute; suposto que o leitor j&aacute; tenha mais ou menos uma bagagem
destes t&oacute;picos e tais conceitos como heran&ccedil;a, descendente.
Como condi&ccedil;&atilde;o pr&eacute;via para a cria&ccedil;&atilde;o
de componentes &eacute; altamente aconselh&aacute;vel ter claro os seguintes
conceitos:
<UL>
<LI>
O que a programa&ccedil;&atilde;o &eacute; guiada a objetos e seus aspectos
fundamentais (fabricantes, destrutivo, classes, heran&ccedil;a, sobrecarregam...)</LI>

<LI>
Dom&iacute;nio do ambiente integrado de desenvolvimento de Delphi.</LI>

<LI>
Administrar com facilidade os diferentes componentes standards do Delphi.</LI>

<LI>
Uso do ObjectBrowser para determinar rela&ccedil;&otilde;es entre objetos.</LI>
</UL>
Se voc&ecirc; precisa de alguma explica&ccedil;&atilde;o nestes t&oacute;picos,
voc&ecirc; pode achar toda a informa&ccedil;&atilde;o necess&aacute;ria
nos pr&oacute;prios manuais de Delphi, como tamb&eacute;m na ajuda on-line.
<BR><A NAME="Periodicidad"></A><IMG SRC="Bverde.gif" ALT="Bverde.gif - .325 K" HEIGHT=14 WIDTH=14><B>
<FONT SIZE=+2>Ritmo do curso.</FONT></B>

<P>Em princ&iacute;pio o periodicidade do curso ser&atilde;o semanais ou
quinzenais, mas tudo depender&aacute; da sua resposta, os usu&aacute;rios
do curso como tamb&eacute;m de minha prontid&atilde;o ao longo do tempo
(voc&ecirc; j&aacute; sabe, exames e essas coisas).
<BR><A NAME="Consultas"></A><IMG SRC="Bverde.gif" ALT="Bverde.gif - .325 K" HEIGHT=14 WIDTH=14><B><FONT SIZE=+2>
Voc&ecirc; consulta, d&uacute;vidas, sugest&otilde;es...</FONT></B>

<P>Este curso n&atilde;o estaria completo sem sua colabora&ccedil;&atilde;o,
assim eu espero sua&nbsp; critica, sugest&atilde;o, propostas de componentes,
exemplos pr&aacute;ticos, etc. No seguinte e-mail: <A HREF="mailto:revueltaroche@redestb.es">revueltaroche@redestb.es</A>

<P>Se voc&ecirc; desenvolveu algum componente que voc&ecirc; acredita que
pode ser interessante, voc&ecirc; esta convidado a compartilhar isto com
todos os leitores do curso.

<P>N&atilde;o se esque&ccedil;a: O interesse e a praticidade deste curso
tamb&eacute;m depende de voc&ecirc;...
<BR>
<HR>
<ADDRESS>
Luis Roche <A HREF="mailto:revueltaroche@redestb.es">revueltaroche@redestb.es</A></ADDRESS>

<BR>Ultima modificaci&oacute;n 5.12.1996
</BODY>
</HTML>
